app/Controllers/Book.php

SELECT *
FROM `book`
ORDER BY `id` DESC
---
    public function index(){
        $userModel = new BookModel();
        $data['book'] = $userModel->orderBy('id', 'DESC')->findAll();

DELETE FROM `book`
WHERE `id` = '16'
AND `id` IN ('16')
---
    public function delete($id){
        $userModel = new BookModel();
        $data['book'] = $userModel->where('id', $id)->delete($id);