app/Controllers/Book.php

SELECT *
FROM `person`
---
    public function create(){
        $type = new RoomType();
        $data['roomtype'] = $type->findAll();

        $person = new Person();
        $data['person'] = $person->findAll();

INSERT INTO `book` (`address`, `roomtype`, `guests`, `first`, `last`, `contract`, `arridate`, `arritime`, `depdate`, `deptime`, `stay`) VALUES ('Dhanmundi', '3', '4', 'Tanvir', 'Hasan', '01793800828', '2023-10-28', '10:33', '2023-10-27', '10:33', '7')
---
    public function store() {
        $userModel = new BookModel();

        $data = [
            'address' => $this->request->getPost('address'),
            'roomtype' => $this->request->getPost('roomtype'),
            'guests' => $this->request->getPost('guests'),
            'first' => $this->request->getPost('first'),
            'last' => $this->request->getPost('last'),
            'contract' => $this->request->getPost('contract'),
            'arridate' => $this->request->getPost('arridate'),
            'arritime' => $this->request->getPost('arritime'),
            'depdate' => $this->request->getPost('depdate'),
            'deptime' => $this->request->getPost('deptime'),
            'stay'  => $this->request->getPost('stay'),
        ];
        $userModel->insert($data);

SELECT *
FROM `book`
WHERE `id` = '48'
 LIMIT 1
SELECT *
FROM `person`
---
    public function singleUser($id){
        $userModel = new BookModel();
        $data['book_obj'] = $userModel->where('id', $id)->first();

        $type = new RoomType();              //dropdown rk_sh
        $data['roomtype'] = $type->findAll();

        $person = new Person();               //dropdown rk_sh
        $data['person'] = $person->findAll();

SELECT *
FROM `book`
WHERE `id` = '43'
 LIMIT 1
---
    public function singleprint($id){
        $userModel = new BookModel();
        $data['book'] = $userModel->where('id', $id)->first();