app/Controllers/Book.php

SELECT *
FROM `book`
JOIN `roomcatagory` ON `roomcatagory`.`room_id` = `book`.`roomtype`
JOIN `person` ON `person`.`person_id` = `book`.`guests`
ORDER BY `book`.`id` DESC
---
            public function checkout(){
                $userModel = new BookModel();
                $data['book'] = $userModel
                    ->join('roomcatagory', 'roomcatagory.room_id = book.roomtype')  //tablerelation ...rk_hs roomcatagory(table)
                    ->join('person', 'person.person_id = book.guests')
                    ->orderBy('book.id', 'DESC')->findAll();  //rk_hs