app/Controllers/EmployController.php

SELECT *
FROM `employs`
ORDER BY `id` DESC
---
    public function employ(){
        $employModel = new EmployModel();
        $data['employs'] = $employModel->orderBy('id', 'DESC')->findAll();

INSERT INTO `employs` (`name`, `email`, `phone`, `age`, `designation`) VALUES ('Tarik', 'wdpf23@gmail.com', '8754674', '23', '3')
---
    public function storeemploy() {
        $employModel = new EmployModel();
        $data = [
            'name' => $this->request->getVar('name'),
            'email'  => $this->request->getVar('email'),
            'phone'  => $this->request->getVar('phone'),
            'age'  => $this->request->getVar('age'),
            'designation'  => $this->request->getVar('designation'),
        ];
        $employModel->insert($data);