app/Controllers/Home.php

SELECT *
FROM `rooms`
ORDER BY `id` DESC
---
    public function index()
    {
        $roomModel = new RoomModel();
        $data['rooms'] = $roomModel->orderBy('id', 'DESC')->findAll(); //for join