app/Controllers/Master.php

SELECT *
FROM `users`
SELECT *
FROM `book`
SELECT *
FROM `rooms`
SELECT *
FROM `employs`
---
    public function dash()
        {
            // Below to Dashboard Counter
            $users = new UserModel();
            $data['user'] =$users->get()->getNumRows();

            $books = new BookModel();
            $data['book'] = $books->get()->getNumRows();

            $room = new RoomModel();
           $data['room'] = $room->get()->getNumRows();



           $employ = new EmployModel();
           $data['employs'] = $employ->get()->getNumRows();