app/Controllers/RoomController.php

SELECT *
FROM `rooms`
ORDER BY `id` DESC
---
    public function listroom() {
        $roomModel = new RoomModel();
        $data['rooms'] = $roomModel->orderBy('id', 'DESC')->findAll(); //for join