app/Controllers/SigninController.php

SELECT *
FROM `login`
WHERE `email` = ''
 LIMIT 1
---
    public function loginAuth()
    {
        $session = session();
        $userModel = new LoginModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $userModel->where('email', $email)->first();