app/Controllers/UserCrud.php

SELECT *
FROM `users`
ORDER BY `id` DESC
---
    public function index(){
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'DESC')->findAll();

INSERT INTO `users` (`name`, `email`, `phone`, `age`, `address`) VALUES ('Tanvir', 'tan@gmail.com', '8754674', '26', 'Saver')
---
    public function store() {
        $userModel = new UserModel();
        $data = [
            'name' => $this->request->getVar('name'),
            'email'  => $this->request->getVar('email'),
            'phone'  => $this->request->getVar('phone'),
            'age'  => $this->request->getVar('age'),
            'address'  => $this->request->getVar('address'),
        ];
        $userModel->insert($data);

DELETE FROM `users`
WHERE `id` = '4'
AND `id` IN ('4')
---
    public function delete($id = null){
        $userModel = new UserModel();
        $data['user'] = $userModel->where('id', $id)->delete($id);